ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
uint16_t length          = 4;//MAX LENGTH is 20
int SCAN_WINDOW         = 100;
int SCAN_INTERVAL       = SCAN_WINDOW+100;
int SCAN_DURATION       = 0x0000;
int configDuration      = 5000;                                                          //Timout when scanning. 0x0000 disables timeout.
int ackTime             = 5000;
int configTime          = 5000;
//------------------------------------------------------
// Multi Sleep time setup
//------------------------------------------------------
int relayTime[4]       = {2000,4000,8000,16000};
int advTime            = 1000;
int sleepTime          = 6000;
int scanTime[3]        = { 750, 500, 1000 };
int scanTimeVer        = 0;
int scanDuration       = 1000;
int timeVer            = 1;
//------------------------------------------------------
static int battTime = 900000;
static uint16_t waitTH = 3;
static ble_gap_scan_params_t const m_scan_params =
{
    .active = 0,
    .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    .scan_phys = BLE_GAP_PHY_1MBPS,
    .interval = (uint16_t)SCAN_INTERVAL,
    .window = (uint16_t)SCAN_WINDOW,
    .timeout = (uint16_t)SCAN_DURATION
};

static uint8_t m_scan_buffer_data[BLE_GAP_SCAN_BUFFER_MIN]; /**< buffer where advertising reports will be stored by the SoftDevice. */

static ble_data_t m_scan_buffer =
{
    m_scan_buffer_data,
    BLE_GAP_SCAN_BUFFER_MIN
};
void ble_scanner_init(void);
void scan_start(void);
void on_adv_report(ble_gap_evt_adv_report_t const *p_adv_report);
void ble_scanner_evt_handler(ble_evt_t const *p_ble_evt, void *p_context);
void ble_scanner_stack_init(void);
void init_scanning_data(void);
NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_scanner_evt_handler, NULL);

#define NON_CONNECTABLE_ADV_INTERVAL MSEC_TO_UNITS(ADV_W, UNIT_0_625_MS) /**< The advertising interval for non-connectable advertisement (100 ms). This value can vary between 100ms to 10.24s). */
#define APP_COMPANY_IDENTIFIER 0x0059                                                                    /**< Company identifier for Nordic Semiconductor ASA. as per www.bluetooth.org. */
#define APP_COMPANY_IDENTIFIER_EXT 0x0059                                                            /**< Company identifier for Nordic Semiconductor ASA. as per www.bluetooth.org. */
#define MAIN_TAPE_ID_0 0x09
#define MAIN_TAPE_ID_1 0xFA
#define APP_BEACON_INFO_LENGTH 0x18

//BLE ADVERTISING
static ble_gap_adv_params_t m_adv_params;                                         /**< Parameters to be passed to the stack when starting advertising. */
static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET; /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];    /**< Buffer for storing an encoded advertising set. */
void ble_adv_init(void);
uint8_t *adv_address, *adv_data;
uint16_t adv_len = 0;
uint16_t data_len = 31;
int8_t rssi;
#define NUMBER_UNIQUE_ADDR 5
struct adv_seen
{
    uint8_t addr[6];
    int8_t rssi;
    int8_t temp;
    int8_t accel;
    uint8_t sorted;
};
struct adv_sent {
    uint8_t addr[2];
    struct adv_seen peers[NUMBER_UNIQUE_ADDR];
} main_tape;

static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = NULL,
        .len = 0
    },
};

uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] = {0x49, 0x54};

#define NUMBER_OF_TAGS 1
#define NUMBER_OF_LOGS 4
#define SLEEP_TIME_SEC 60
#define MAX_ID_BUF_LENGTH 15
#define TIME_STRING_LENGTH 25

int32_t volatile temp;
struct tagRec
{
    uint32_t subID;
    uint8_t addr[MAX_ID_BUF_LENGTH];
    int8_t rssi;
    int Lorarssi;
    uint16_t accTrigCount;
    int tempRec;
    float subBat;
    uint16_t counter;
    float latt;
    float lont;
    //uint32_t currentTime;
    uint16_t millisTime;
};
typedef struct logRec
{
    uint16_t logNo;
    float clat;
    float clon;
    float glat;
    float glon;
    int numberOfScanned;
    char timeStr[TIME_STRING_LENGTH];
    char relayId[MAX_ID_BUF_LENGTH];
    float relayBat;
    tagRec scanLog[NUMBER_OF_TAGS];
} logRec_t;
logRec_t TapeLog[NUMBER_OF_LOGS];

//AK25 struct tagRec tags[NUMBER_OF_LOGS][NUMBER_OF_TAGS];
static char idBuf[MAX_ID_BUF_LENGTH];
static char idString[MAX_ID_BUF_LENGTH];

//const nrf_drv_timer_t WAKEUP_TIMER = NRF_DRV_TIMER_INSTANCE(0);
static uint32_t sleep_time_ms;

//Global variables
int comm_freq;
float lat = 0.0;
float lon = 0.0;
int rtcCountTimeout = 0;
int timeroutPeriod = SLEEP_TIME_SEC;
int16_t adcResult[5] = {0};
float prescise_result = 0;
volatile int timerFlag = 0;
int globalSendCounter = 0;
int logCounterf = 0;
int logCountert = 0;
int timeoutFlagb = 0;
int timeoutFlagc = 0;
int sleepflag = 0;
//AK int noSendCounter = 1;
int noSendCounter = 0;
int last_noSendCounter = 0;
int tempperiod = 1;
int last_tempperiod;
uint32_t bestSubID;
int bestLorarssi;
bool sendFlag = false;
uint32_t r = 0;
int LoggingCount = 0;
int NumberOfLogsPerSend = 0;
bool setupFlag = true;
bool gprsSetupFlag = true;
bool OTA = false;
uint8_t MODE = 0;
uint16_t batteryV = 0;
int planeEventCounter = 0;
uint32_t millis_init = 0;
uint32_t appUnixtime = 1564951366;
uint32_t tapeUnixtime = 1652;
int8_t rssiTH = -100;
int8_t rssi_threshold = -70;
int ble_scan_duration = 10000;
int ble_adv_duration = 3000;
int gps_scan_duration = 30000;
bool ota_flag = false;

//airplane shutoff var
int16_t acc_x, acc_y, acc_z;
uint8_t acc_threshold_H = 238; // thresold value for acc (0.212/0.00781)
uint8_t acc_threshold_L = 225; // thresold value for acc (0.212/0.00781)
uint8_t acc_threshold = 254;     // thresold value for acc (0.212/0.00781)
uint8_t acc_th_duration = 254; // duration in millisecond
int acc_sum_threshold = 511;
bool shutoffFlag_a = false;
bool shutonFlag_a = false;
bool shutoffFlag_p = false;
bool shutonFlag_p = false;
bool airplane_landed = false;
bool in_airplane = false;
int lastPressure = 0;
int pressureGradientThreshold_T = -60000; //-35
int pressureGradientThreshold_L = 60000;    //50
int sum = 0;
int accelThreshold = 3;
int time_c = 0;
int time_p = 0;
bool mode_flag = true;
uint8_t bno_initialized = 0;

