ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
            }
        }
    }

    scan_start();
    return;
}

void ble_scanner_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    if (p_ble_evt->header.evt_id == BLE_GAP_EVT_ADV_REPORT)
    {
        on_adv_report(&p_gap_evt->params.adv_report);
    }
}

void ble_scanner_stack_init(void)
{
    uint32_t ram_start = 0;
    uint32_t error_code;

    error_code = nrf_sdh_enable_request();
    error_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    error_code = nrf_sdh_ble_enable(&ram_start);
}


void timer_event_handler(void *p_context)
{
#ifdef TEST
    printf("app timeout\n");
#endif //TEST
    timerFlag = 1;
    if (sleepflag == 1)
    {
        if (noSendCounter <= 0)
        {
            timeoutFlagb = 1;
            sleepflag = 0;

#ifdef MULTIPLE_SCAN_PER_SEND
            if (LoggingCount >= NumberOfLogsPerSend)
            {
                LoggingCount = 0;
                sendFlag = true;
            }
            else
            {
                LoggingCount++;
            }
#else // MULTIPLE_SCAN_PER_SEND
            sendFlag = true;
#endif // MULTIPLE_SCAN_PER_SEND
        }
        else
        {
            start_timer(1000 * timeroutPeriod);
            noSendCounter--;
            printf("skipped sending %d\n", noSendCounter);
            sendFlag = false;
        }
    }
}

void start_timer(int32_t miliTimeout)
{
    //We have 10 timer instances we can use, we only use 1, this re-creates it each time
    app_timer_create(&timer_id, APP_TIMER_MODE_SINGLE_SHOT, timer_event_handler); // can also use the single shot mode
    app_timer_start(timer_id, APP_TIMER_TICKS(miliTimeout), NULL);                                //e.g. for 2000 ms
    timerFlag = 0;
}

void init_timer2(void)
{
    app_timer_create(&clock_id, APP_TIMER_MODE_REPEATED, timer2_event_handler);
    app_timer_start(clock_id, APP_TIMER_TICKS(CLOCK_RESOULATION__ms), NULL);
}

void advertising_init(void)
{
    uint32_t err_code;
    ble_advdata_t advdata;
    uint8_t flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    ble_advdata_manuf_data_t manuf_specific_data;

#if ADV_SCANNER_FW == 1
    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER_EXT;
#else
    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;
#endif
    manuf_specific_data.data.p_data = (uint8_t *)m_beacon_info;
    manuf_specific_data.data.size = APP_BEACON_INFO_LENGTH;

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type = BLE_ADVDATA_NO_NAME;
    advdata.flags = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    m_adv_params.p_peer_addr = NULL; // Undirected advertisement.
    m_adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval = NON_CONNECTABLE_ADV_INTERVAL;
    m_adv_params.duration = 0; // Never time out.

    ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
}

void advertising_start(void)
{
    sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
}

void advertising_stop(void)
{
    sd_ble_gap_adv_stop(m_adv_handle);
}

void ble_adv_stack_init(void)
{
    uint32_t ram_start = 0;
    uint32_t ret;

    ret = nrf_sdh_enable_request();
    //printf("req ret = %x\n", ret);
    nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    //printf("ram address    = %x\n", ram_start);
    ret = nrf_sdh_ble_enable(&ram_start);
    //printf("en ret = %x\n", ret);
}

void ble_adv_init(void)
{
    ble_adv_stack_init();
    advertising_init();
    advertising_start();
}

void ble_scanner_init(void)
{
    ble_scanner_stack_init();
    scan_start();
}

void datasend()
{
    memset(data_array,0,sizeof(data_array));
    data_array[0] = 'A';
    data_array[1] = 'C';
    data_array[2] = 'K';
    data_array[3] = '1';
    ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
    printf("Notified with ACK\n");
}

#ifdef UD_SER
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    printf("Softdevice asserted!\n");
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        printf("\nReceived data (%d bytes) from BLE NUS: ",p_evt->params.rx_data.length);
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            printf("%02X:",p_evt->params.rx_data.p_data[i]);
        }
        printf("\n");

        if(p_evt->params.rx_data.p_data[2] == 1)
        {
            OTA = true;

            NRF_POWER->GPREGRET = 0xB1;
            nrf_delay_ms(100);
            NVIC_SystemReset();
        }

        lora_selected = p_evt->params.rx_data.p_data[4];
        celltxrx = p_evt->params.rx_data.p_data[5];
        advTime = (int)((int)(p_evt->params.rx_data.p_data[6])*1000);

        txlevel = p_evt->params.rx_data.p_data[7];
        scanDuration = (int)((int)(p_evt->params.rx_data.p_data[8])*1000);
        sleepTime = (int)((int)(p_evt->params.rx_data.p_data[9])*1000);
        MODE = p_evt->params.rx_data.p_data[10];

        //channel = (p_evt->params.rx_data.p_data[11]);

        int j = 0;
        unsigned char received_frequency[4];
        float my_frequency;
        for (int i = 11; i < 15; i++)
        {
            received_frequency[j++] = (p_evt->params.rx_data.p_data[i]);
        }
        memcpy(&my_frequency, &received_frequency, sizeof(my_frequency));
        channel = (int)my_frequency;
        
        datasend();
    }
}

void gap_params_init(void)
{
    ble_gap_conn_params_t     gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    sd_ble_gap_device_name_set(&sec_mode,(const uint8_t *)DEVICE_NAME,strlen(DEVICE_NAME));

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency         = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout    = CONN_SUP_TIMEOUT;

    sd_ble_gap_ppcp_set(&gap_conn_params);
}


void services_init(void)
{
    ble_nus_init_t         nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    // Initialize Queued Write Module.
    qwr_init.error_handler = NULL;

    nrf_ble_qwr_init(&m_qwr, &qwr_init);
    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));
    nus_init.data_handler = nus_data_handler;
    ble_nus_init(&m_nus,&nus_init);
}


void conn_params_evt_handler(ble_conn_params_evt_t * p_evt)
{
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    }
}

void conn_params_init(void)
{
    ble_conn_params_init_t cp_init;
    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = conn_params_evt_handler;
    cp_init.error_handler                  = NULL;
    ble_conn_params_init(&cp_init);
}

void ble_ud_stack_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
#ifdef TEST
            printf("Connected.\n");
#endif
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            connected = true;
            break;

    case BLE_GAP_EVT_DISCONNECTED:
#ifdef TEST
            printf("Disconnected, reason %d.\n",p_ble_evt->evt.gap_evt.params.disconnected.reason);
#endif
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            connected = false;
            timerFlag = 1;
            break;

