ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
#ifdef TEST
            printf("PHY update request.\n");
#endif
            ble_gap_phys_t phys;
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        break;

        case BLE_GATTC_EVT_TIMEOUT:
#ifdef TEST
            printf("GATT Client Timeout.\n");
#endif
            sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
#ifdef TEST
            printf("GATT Server Timeout.\n");
#endif
            sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            break;

        default:
            break;
    }
}

void scan_start(void)
{
    (void)sd_ble_gap_scan_stop();
    sd_ble_gap_scan_start(&m_scan_params, &m_scan_buffer);
}

void ble_ud_stack_init(void) {
  uint32_t err_code = NRF_SUCCESS;

  err_code = nrf_sdh_enable_request();
  printf("error code: %d\n", err_code);

  

  APP_ERROR_CHECK(err_code);
  uint32_t ram_start = 0;

  err_code = nrf_sdh_ble_app_ram_start_get( &ram_start);
  printf("ram error code: %d\n", err_code);
  printf("ram_start: 0x %x\n", ram_start);

  if (nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start) != NRF_SUCCESS)
    printf("ud fail\n");

  // Enable BLE stack.
  err_code = nrf_sdh_ble_enable(&ram_start);
  printf("error code: %d\n", err_code);
//  if (nrf_sdh_ble_enable(&ram_start) != NRF_SUCCESS) {
//    printf("ud memory fail\n");
//  }

  NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_ud_stack_evt_handler, NULL);
}

void ud_advertising_init(void)
{
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type                    = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;     // BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids    = m_adv_uuids;

    init.config.ble_adv_fast_enabled    = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout    = APP_ADV_DURATION;
    init.evt_handler = NULL;
    ble_advertising_init(&m_advertising, &init);
    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);

}

void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        printf("Data len is set to 0x%X(%d)\n", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }

    printf("ATT MTU exchange completed. central 0x%x peripheral 0x%x\n",
                                p_gatt->att_mtu_desired_central,
                                p_gatt->att_mtu_desired_periph);
}


void gatt_init(void)
{
    nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
}

void ud_advertising_start(void)
{
    ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
}
#endif //UD_SER


void ud_init(void)
{
#ifdef UD_SER
    ble_ud_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    ud_advertising_init();
    conn_params_init();
#ifdef TEST
    printf("UD_Init...Done...!\n");
#endif
    //application_timers_start();
    ud_advertising_start();
    connected = false;
    printf("UD_Start...!\n");
#endif //UD_SER
}

void sel_txpower(int tx_level)
{
    switch(tx_level)
    {
        case 0:
            txpower = RADIO_TXPOWER_TXPOWER_Neg40dBm; /**< Radio output power. */
        break;

        case 1:
            txpower = RADIO_TXPOWER_TXPOWER_Neg30dBm; /**< Radio output power. */
        break;

        case 2:
            txpower = RADIO_TXPOWER_TXPOWER_Neg20dBm; /**< Radio output power. */
        break;

        case 3:
            txpower = RADIO_TXPOWER_TXPOWER_Neg16dBm; /**< Radio output power. */
        break;

        case 4:
            txpower = RADIO_TXPOWER_TXPOWER_Neg12dBm; /**< Radio output power. */
        break;

        case 5:
            txpower = RADIO_TXPOWER_TXPOWER_Neg8dBm; /**< Radio output power. */
        break;

        case 6:
            txpower = RADIO_TXPOWER_TXPOWER_Neg4dBm; /**< Radio output power. */
        break;

        case 7:
            txpower = RADIO_TXPOWER_TXPOWER_0dBm; /**< Radio output power. */
        break;

        case 8:
            txpower = RADIO_TXPOWER_TXPOWER_Pos4dBm; /**< Radio output power. */
        break;

        default:
            txpower = RADIO_TXPOWER_TXPOWER_0dBm; /**< Radio output power. */
        break;
    }
}

void radio_disable(void)
{
    NRF_RADIO->SHORTS = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_TXEN = 0;
    NRF_RADIO->TASKS_STOP = 1;
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->EVENTS_END = 1U;

    while (NRF_RADIO->EVENTS_DISABLED == 0)
    {
            // Do nothing.
    }
    NRF_RADIO->EVENTS_DISABLED = 0;
}

void radio_config(void)
{
    NRF_RADIO->POWER = 1;
    NRF_RADIO->SHORTS    = RADIO_SHORTS_READY_START_Msk;
    sel_txpower(txlevel);
    NRF_RADIO->TXPOWER = (txpower << RADIO_TXPOWER_TXPOWER_Pos);
    NRF_RADIO->MODE        = (mode << RADIO_MODE_MODE_Pos);
    NRF_RADIO->FREQUENCY = channel;
    NRF_RADIO->TASKS_TXEN = 1;
}


void modulation(void)
{
    mode = RADIO_MODE_MODE_Ble_2Mbit;

    // Reset Radio ramp-up time.
    NRF_RADIO->MODECNF0 &= (~RADIO_MODECNF0_RU_Msk);

    // Packet configuration:
    // Bit 25: 1 Whitening enabled
    // Bit 24: 1 Big endian,
    // 4-byte base address length (5-byte full address length),
    // 0-byte static length, max 255-byte payload.
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Enabled << RADIO_PCNF1_WHITEEN_Pos) |
                      (RADIO_PCNF1_ENDIAN_Big << RADIO_PCNF1_ENDIAN_Pos) |
                      (4UL << RADIO_PCNF1_BALEN_Pos) |
                      (0UL << RADIO_PCNF1_STATLEN_Pos) |
                      ((sizeof(m_tx_packet) - 1) << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_LEN_Disabled << RADIO_CRCCNF_LEN_Pos);

    // Set the device address 0 to use when transmitting
    NRF_RADIO->TXADDRESS   = 0x00UL;
    // Enable the device address 0 to use to select which addresses to receive
    NRF_RADIO->RXADDRESSES = 0x01UL;

    //TRANSMIT_PATTERN_11001100:
    NRF_RADIO->PREFIX0 = 0xCC;
    NRF_RADIO->BASE0     = 0xCCCCCCCC;

    NRF_RADIO->PCNF0 = (0UL << RADIO_PCNF0_S1LEN_Pos) |
                       (0UL << RADIO_PCNF0_S0LEN_Pos) |
                       (RADIO_PCNF0_PLEN_16bit << RADIO_PCNF0_PLEN_Pos) |
                       (RADIO_LENGTH_LENGTH_FIELD << RADIO_PCNF0_LFLEN_Pos);

    m_tx_packet[0] = sizeof(m_tx_packet) - 1;

    // Fill payload with random data.
    for (uint8_t i = 0; i < sizeof(m_tx_packet) - 1; i++)
    {
          m_tx_packet[i + 1] = 0xCC;
    }

    NRF_RADIO->PACKETPTR = (uint32_t)m_tx_packet;

