ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_START_Msk;

    sel_txpower(txlevel);
    NRF_RADIO->TXPOWER    = (txpower << RADIO_TXPOWER_TXPOWER_Pos);
    NRF_RADIO->MODE       = (mode << RADIO_MODE_MODE_Pos);
    NRF_RADIO->FREQUENCY  = channel;
    NRF_RADIO->EVENTS_END = 0U;
    NRF_RADIO->TASKS_TXEN = 1;

    while (NRF_RADIO->EVENTS_END == 0U)
    {
        // wait
    }
}

void radio_rx()
{
    NRF_RADIO->MODE      = (mode << RADIO_MODE_MODE_Pos);
    NRF_RADIO->SHORTS    = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_START_Msk;
    NRF_RADIO->PACKETPTR = (uint32_t)g_rx_packet;

    // Reset Radio ramp-up time.
    NRF_RADIO->MODECNF0 &= (~RADIO_MODECNF0_RU_Msk);

    // Packet configuration:
    // Bit 25: 1 Whitening enabled
    // Bit 24: 1 Big endian,
    // 4-byte base address length (5-byte full address length),
    // 0-byte static length, max 255-byte payload .
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Enabled << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big << RADIO_PCNF1_ENDIAN_Pos) |
                       (4UL << RADIO_PCNF1_BALEN_Pos) |
                       (0UL << RADIO_PCNF1_STATLEN_Pos) |
                       ((sizeof(m_tx_packet) - 1) << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_LEN_Disabled << RADIO_CRCCNF_LEN_Pos);

    NRF_RADIO->TXADDRESS   = 0x00UL; // Set the device address 0 to use when transmitting
    NRF_RADIO->RXADDRESSES = 0x01UL; // Enable the device address 0 to use to select which addresses to receive
    NRF_RADIO->PREFIX0 = 0xCC;
    NRF_RADIO->BASE0   = 0xCCCCCCCC;


    // Packet configuration:
    // S1 size = 0 bits, S0 size = 0 bytes, payload length size = 8 bits, 16-bit preamble.
    NRF_RADIO->PCNF0 =  (0UL << RADIO_PCNF0_S1LEN_Pos) |
                        (0UL << RADIO_PCNF0_S0LEN_Pos) |
                        (RADIO_PCNF0_PLEN_16bit << RADIO_PCNF0_PLEN_Pos) |
                        (RADIO_LENGTH_LENGTH_FIELD << RADIO_PCNF0_LFLEN_Pos);

    NRF_RADIO->FREQUENCY = channel;
    NRF_RADIO->TASKS_RXEN = 1U;
}

void prepare_sleep()
{
    nrf_sdh_disable_request();
}

void prepare_wake()
{
}

void tapeDiagnosis(void)
{
    prepare_sleep();
    prepare_wake();
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.

    // BLE
    if (celltxrx == 0) {
      printf(DBG_BLUE "BLE Radio Selected\n" DBG_RESET);
      radio_disable();
    }
    // CELL
    else if (celltxrx > 0) {
      printf(DBG_GREEN "Cell Radio Selected\n" DBG_RESET);
    }

    if(debugMode) // TRUE -> interval
    {
        while(1)
        {   
            // Cell - enabled and transmit
            if(celltxrx == 1 && advTime > 0)
            {
                printf(DBG_GREEN "Cell CW Radio Transmit\n" DBG_RESET);
                nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, false);
            }
            
            // BLE - enabled and transmit
            else if(celltxrx == 0 && advTime > 0)
            {
                printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
                radio_config();
            }
            
            // Cell/BLE Advertise time
            if(advTime > 0)
            {
            start_timer(advTime);

            while(!timerFlag)
            {
                nrf_pwr_mgmt_run();
            }

            stop_timer();
          }
            
            // Cell - disable
            if(celltxrx == 1)
            {
                #ifdef test_print
                printf(DBG_GREEN "Cell Radio Disabled\n" DBG_RESET);
                #endif //test_print
                nbiot_instance.CwFunction(1, 0, channel, cellpowerlevel, false);
            }
            // BLE - disable
            else if (celltxrx == 0)
            {
                #ifdef test_print
                printf(DBG_BLUE "BLE Radio Disabled\n" DBG_RESET);
                #endif //test_print
                radio_disable();
            }
            
            // Cell/BLE sleep time
            if (sleepTime != 0)
            {
                printf(DBG_YELLOW "Cell/BLE Radio Sleep\n" DBG_RESET);
                start_timer(sleepTime);

                while (!timerFlag)
                {
                    nrf_pwr_mgmt_run();
                }
            }
            
            // Cell - enabled and receive
            if ((celltxrx == 2) && scanDuration >0)
            {
                printf(DBG_GREEN "CELL Interval Radio receive\n" DBG_RESET);
                printf(DBG_MAGENTA "-------scanDuration: %d\n" DBG_RESET, scanDuration);
                cell_interval_receive(scanDuration);
            }

              
            // BLE - enabled and receive
            else if (celltxrx == 0 && scanDuration >0)
            {
                printf(DBG_BLUE "BLE Radio Scan\n" DBG_RESET);
                
                bleScan(scanDuration);
//                radio_rx();
//                start_timer(scanDuration);
//
//                while (!timerFlag)
//                {
//                    nrf_pwr_mgmt_run();
//                }
//
//                stop_timer();
            }

            if(scanDuration > 0 && advTime == 0 && sleepTime == 0)
            {
              printf("Do not measure temperature\n");
            }
            else {
             #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            }
        }
    }
    else
    {
        if (celltxrx == 1)
        {
            printf(DBG_GREEN "LoRa Radio Transmit\n" DBG_RESET);
            nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, false);
        }
        else if(celltxrx == 2 && scanDuration == 0 && advTime == 0)
        {
            nbiot_instance.CwFunction(0, 1, channel, cellrxpowerlevel, false);
        }
        else if (celltxrx == 0)
        {
            printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
            radio_config();  
        }

        while(1)
        {
            nrf_pwr_mgmt_run();
            #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            nrf_delay_ms(1000);
        }
    }
}

void radio_with_data1(bool flag)
{
    prepare_sleep();
    prepare_wake();
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.

    // BLE
    if (celltxrx == 0) {
      printf(DBG_BLUE "BLE Radio Selected\n" DBG_RESET);
      radio_disable();
    }
    // CELL
    else if (celltxrx > 0) {
      printf(DBG_GREEN "Cell Radio Selected\n" DBG_RESET);
    }

    if(flag) // TRUE -> interval
    {
        while(1)
        {   
            // Cell - enabled and transmit
            if(celltxrx == 1 && advTime > 0)
            {
                printf(DBG_GREEN "LoRa Radio Transmit\n" DBG_RESET);
                nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, true);
            }
            
            // BLE - enabled and transmit
            else if (celltxrx == 0 && advTime > 0)
            {
                printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
                modulation();
            }
            
            // Cell/BLE Advertise time
            if(advTime > 0)
            {
              start_timer(advTime);

              while(!timerFlag)
              {
                  nrf_pwr_mgmt_run();
              }

              stop_timer();
            }
            
            // LoRa - disable
            if(celltxrx == 1)
            {
                #ifdef test_print
                printf(DBG_GREEN "LoRa Radio Disabled\n" DBG_RESET);
                #endif //test_print
                nbiot_instance.CwFunction(1, 0, channel, cellpowerlevel, true);
            }
            // BLE - disable
            else if (celltxrx == 0)
            {
                #ifdef test_print
                printf(DBG_BLUE "BLE Radio Disabled\n" DBG_RESET);
                #endif //test_print
                radio_disable();
            }
            
            // Cell/BLE sleep time
            if (sleepTime != 0)
            {
                printf(DBG_YELLOW "Cell/BLE Radio Sleep\n" DBG_RESET);
                start_timer(sleepTime);

                while (!timerFlag)
                {
                    nrf_pwr_mgmt_run();
                }
            }
            
            // Cell - enabled and receive
            if (celltxrx == 2 && scanDuration >0)
            {
                printf(DBG_GREEN "Cell Interval Radio receive\n" DBG_RESET);
                printf(DBG_MAGENTA "-------scanDuration: %d\n" DBG_RESET, scanDuration);
                cell_interval_receive_modulated(scanDuration);
            }
              
            // BLE - enabled and receive
            else if(celltxrx == 0 && scanDuration >0)
            {
                printf(DBG_BLUE "BLE Radio Scan\n" DBG_RESET);
                
                bleScan(scanDuration);
//                radio_rx();
//                start_timer(scanDuration);
//
//                while (!timerFlag)
//                {
//                    nrf_pwr_mgmt_run();
//                }
//
//                stop_timer();
            }
            if (scanDuration > 0 && advTime == 0 && sleepTime == 0) {
              printf("Do not measure temperature\n");
            } else {
            #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            }
        }
            
