ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
    }
    else
    {
        if (celltxrx == 1)
        {
            printf(DBG_GREEN "Cell Modulated Radio Transmit\n" DBG_RESET);
            nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, true);
        }
        else if (celltxrx == 2)
        {
            printf(DBG_GREEN "Cell Modulated Radio Receive\n" DBG_RESET);
            nbiot_instance.CwFunction(0, 1, channel, cellpowerlevel, true);
        }
        else if (celltxrx == 0)
        {
            printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
            modulation();   
        }

        while(1)
        {
            nrf_pwr_mgmt_run();
            #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            nrf_delay_ms(1000);
        }
    }
}

void bufferclearTape(void)
{
#ifdef RESET
    if(!reset_flag)
    {
        advertising_stop();
        memset(m_beacon_info,0,sizeof(m_beacon_info));
        m_beacon_info[0] = 0xDE; //I
        m_beacon_info[1] = 0x1E; //T
        m_beacon_info[2] = rssiTH; //T

        m_beacon_info[3] = (uint8_t)(adcToBat(adcResult[3])*100);
        printf("RssiTH:%02X, BattV:%02X\n",m_beacon_info[2],m_beacon_info[3]);
        advertising_init();
        sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,NULL,TX_POWER[txlevel]);
        advertising_start();
        random_pwr_fix();
        start_timer(battTime);

        while(!timerFlag && !reset_flag)
        {
            nrf_pwr_mgmt_run();
        }

        stop_timer();
    }
    else
    {
        printf("sleep\n");
        advertising_stop();
        random_pwr_fix();

        while(reset_flag)
        {
            nrf_pwr_mgmt_run();
        }
    }
#else
    advertising_stop();
    memset(m_beacon_info,0,sizeof(m_beacon_info));
    m_beacon_info[0] = 0xDE; //I
    m_beacon_info[1] = 0x1E; //T
    m_beacon_info[2] = rssiTH; //T

    m_beacon_info[3] = (uint8_t)(adcToBat(adcResult[3])*100);
    printf("RssiTH:%02X, BattV:%02X\n",m_beacon_info[2],m_beacon_info[3]);
    advertising_init();
    sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,NULL,TX_POWER[txlevel]);
    advertising_start();
    random_pwr_fix();
    start_timer(battTime);

    while(!timerFlag)
    {
        nrf_pwr_mgmt_run();
    }

    stop_timer();
#endif
}

void setConfig(int setTime)
{
    millis_init = millis();
    printf("millis %d\n",millis_init);

    ud_init();
    start_timer(setTime);

    printf("power mgmt-> entring\n");
    while(!timerFlag || connected)
    {
        nrf_pwr_mgmt_run();
    }
    printf("power mgmt-> exiting\n");

    sd_ble_gap_adv_stop(m_advertising.adv_handle);
    nrf_delay_ms(1000);
    nrf_sdh_disable_request();
    nrf_delay_ms(1000);
    stop_timer();

    if(txlevel > 8)
    {
        txlevel = 7;
    }

    if((channel < 0 || channel > 100) && celltxrx == 0)
    {
        channel = 17;
    }
      
    loratxlevel = (int8_t)power_map(txlevel, input_min, input_max, output_min, output_max);
    lorafrequency = 900 + channel;

    cellpowerlevel = (int8_t)power_map(txlevel, cell_input_min, cell_input_max, cell_output_min, cell_output_max);
    cellrxpowerlevel = (int8_t)power_map(txlevel, cellrx_input_min, cellrx_input_max, cellrx_output_min, cellrx_output_max);
    
    printf("OTA: %d\n",           OTA);
    printf("advTime: %d\n",       advTime);
    printf("bletxlevel(d): %d\n", txlevel);
    //printf("loratxlevel(d): %d\n", loratxlevel);
    printf("sleepTime: %d\n",     sleepTime);
    printf("scanDuration: %d\n",  scanDuration);
    printf("MODE: %d\n",          MODE);
    printf(DBG_BLUE "channel: %d\n" DBG_RESET, channel);
    printf(DBG_MAGENTA "Cell Radio TX or RX: %d\n" DBG_RESET, celltxrx);
    printf(DBG_MAGENTA "channel: %d\n" DBG_RESET, channel);
    printf(DBG_MAGENTA "cellpowerlevel: %d\n" DBG_RESET, cellpowerlevel);
    printf(DBG_MAGENTA "cellrxpowerlevel: %d\n" DBG_RESET, cellrxpowerlevel);
    
    

    if(OTA)
    {
        NRF_POWER->GPREGRET = 0xB1;
        //sd_power_gpregret_set(0,0xB1);
        nrf_delay_ms(100);
        NVIC_SystemReset();
    }

//    if(lora_selected)
//    {
//        lora_radio_enable();
//    }
    ble_adv_stack_init();
}

#ifdef RESET
void mode_change(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    reset_flag = !reset_flag;
}

void mode_init()
{
    nrf_drv_gpiote_init();
    nrf_drv_gpiote_in_config_t mode_config;
    mode_config.sense = NRF_GPIOTE_POLARITY_HITOLO;
    mode_config.pull = NRF_GPIO_PIN_NOPULL;
    nrf_drv_gpiote_in_init(6, &mode_config, mode_change);
    nrf_drv_gpiote_in_event_enable(6, true);
}
#endif //RESET

void config_init()
{
    nrf_drv_clock_init();
    nrf_drv_clock_lfclk_request(NULL);
    nrf_pwr_mgmt_init();
}

void get_ble_mac(void)
{
    uint8_t devId[6];
    //char idString[64];

    devId[0] = (NRF_FICR->DEVICEADDR[1] >> 8) | 0xC0;
    devId[1] = (NRF_FICR->DEVICEADDR[1] & 0xFF);
    devId[2] = ((NRF_FICR->DEVICEADDR[0] >> 24) & 0xFF);
    devId[3] = ((NRF_FICR->DEVICEADDR[0] >> 16) & 0xFF);
    devId[4] = ((NRF_FICR->DEVICEADDR[0] >> 8) & 0xFF);
    devId[5] = (NRF_FICR->DEVICEADDR[0] & 0xFF);
    sprintf(idString, "MAC = %02X:%02X:%02X:%02X:%02X:%02X", devId[0], devId[1], devId[2], devId[3], devId[4], devId[5]);
    printf("%s\n", idString);
}

void setVerBits(int V)
{
#ifdef SAS
    printf("Scan: %d\tAdv: %d\tSleep: %d\n",scanDuration,advTime,sleepTime);
#else
    printf("Scan: %d\tAdv: %d\n",scanDuration,sleepTime);
#endif //SAS

    switch(V)
    {
        case 0:
            clearBit(7);
            clearBit(6);
            break;
        case 1:
            clearBit(7);
            setBit(6);
            break;
        case 2:
            setBit(7);
            clearBit(6);
            break;
        case 3:
            setBit(7);
            setBit(6);
            break;
        default:
            clearBit(7);
            clearBit(6);
            break;
    }
}

void get_hw_ver(void)
{
    uint32_t info = NRF_FICR->INFO.VARIANT;
    uint8_t *p = (uint8_t *)&info;
    printf ("nRF%x Variant: %c%c%c%c\n",NRF_FICR->INFO.PART, p[3], p[2], p[1], p[0]);
    printf ("package: %x\n",NRF_FICR->INFO.PACKAGE);
    printf ("DevID: %x%x\n", NRF_FICR->DEVICEID[0],NRF_FICR->DEVICEID[1]);
}

#ifdef CUT
void cut_change(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    cut_flag = !cut_flag;
}

