ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
void print_temperature_sensor_data()
{
    int temperature_fail_counter = 0;
    float temperature_array[5] = {0};

    i2c_wrapper.InitializeI2C();
    tmp_sensor.begin();
    for (int j = 0; j < 5; j++)
    {
        temperature_fail_counter = 0;
        tmp_sensor.setOneShotMode();
        while (tmp_sensor.dataReady() == false && temperature_fail_counter < 5)
        {
            nrf_delay_ms(110);
            temperature_fail_counter++;
        }
        temperature_array[j] = tmp_sensor.readTempC();
    }
    tmp_sensor.setShutdownMode();
    printf("----> Final TMP117 Temp = %3.2f %C\n", temperature_array[0]);
    i2c_wrapper.DeInitializeI2C();
}

long power_map(long x, long in_min, long in_max, long out_min, long out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

void CellTimerEventHandler(void *p_context) {
  cell_timer_flag = 1;
}

void StopCellTimer() {
  app_timer_stop(cell_timer_id);
}

void StartCellTimer(uint32_t mili_sec_timeout) {
  //printf("----------------- Starting Cell Timer ------------------\n");
  uint32_t error_code = 0;
  StopCellTimer();
  app_timer_create(&cell_timer_id, APP_TIMER_MODE_SINGLE_SHOT, CellTimerEventHandler);
  error_code = app_timer_start(cell_timer_id, APP_TIMER_TICKS(mili_sec_timeout), NULL);
  cell_timer_flag = 0;
}

void init_Modem()
{
  printf(DBG_BKG_CYAN "Initializing modem\n" DBG_RESET);
  nbiot_instance.Init(CELL_RX, CELL_TX,StartCellTimer,&cell_timer_flag);
  nrf_delay_ms(2000);
  nbiot_instance.GetConfig();
}

void cell_interval_receive(int rcv_time)
{
    
    printf(DBG_MAGENTA "cell Interval Receive\n" DBG_RESET);

    start_timer(rcv_time);
    nbiot_instance.CwFunction(0, 1, channel, cellrxpowerlevel, false);
    while (!timerFlag)
    {
      nrf_pwr_mgmt_run();
    }
    stop_timer();

    nbiot_instance.CwFunction(0, 0, channel, cellrxpowerlevel, false);
}

void cell_interval_receive_modulated(int rcv_time)
{
    
    printf(DBG_MAGENTA "cell Interval Receive\n" DBG_RESET);

    start_timer(rcv_time);
    nbiot_instance.CwFunction(0, 1, channel, cellpowerlevel, true);
    while (!timerFlag)
    {
      nrf_pwr_mgmt_run();
    }
    stop_timer();

    nbiot_instance.CwFunction(0, 0, channel, cellpowerlevel, true);
}

void stop_hall_effect_timer() {
   printf("Stopping hall effect timer\n");
   app_timer_stop(timer_id_8);
   hallTimer = false;
}

void hall_effect_timer_event_handler(void * p_context)
{
    printf("Hall effect timer event handler\n");
    if(hallCounter < HALL_DFU_THRESHOLD){
    printf("Not enough swipes\n");
    hallCounter = 0;
    }
    stop_hall_effect_timer();
}

void start_hall_effect_timer(uint32_t milliseconds) {
  ret_code_t error_code;

  stop_hall_effect_timer();
  printf("Starting hall effect timer for %d milliseconds\n", milliseconds);
  
  error_code = app_timer_create(&timer_id_8, APP_TIMER_MODE_SINGLE_SHOT, hall_effect_timer_event_handler);
  if (error_code != NRF_SUCCESS) {
    printf("app_timer_create for hall effect timer failed: %d\n", error_code);
  }

  hallTimer = true;

  error_code = app_timer_start(timer_id_8, APP_TIMER_TICKS(milliseconds), NULL);
  if (error_code != NRF_SUCCESS) {
    printf("app_timer_start for hall effect timer failed: %d\n", error_code);
  }
}

void hall_gpio_init() {
  nrf_gpio_cfg_input(HALL_INT ,NRF_GPIO_PIN_NOPULL);
}
void gpiote_hall_evt_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
printf("hall triggered\n");
hallCounter++;
if(hallTimer == false){
    start_hall_effect_timer(8000);
  }
 if(hallCounter >= 10){
 //NRF_POWER->GPREGRET = 0xB1;
 NVIC_SystemReset();
 }
}
void config_hall_sensor() {
  nrfx_gpiote_in_config_t hall_config;
  hall_config.is_watcher = false;
  hall_config.hi_accuracy = false;
  hall_config.skip_gpio_setup = false;
  hall_config.sense = NRF_GPIOTE_POLARITY_TOGGLE;
  hall_config.hi_accuracy = true;
  hall_config.pull = NRF_GPIO_PIN_NOPULL;
  if (nrfx_gpiote_in_init(HALL_INT, &hall_config, gpiote_hall_evt_handler) != NRFX_SUCCESS) {
    printf("nrfx_gpiote_in_init failed for hall effect sensor\n");
  }
  nrfx_gpiote_in_event_enable(HALL_INT, true);
}
sm_state soc_init()
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    config_init();
    get_ble_mac();
    get_hw_ver();
    init_timer();
    init_timer2();

    return STATE_BOARD_INIT;
}
sm_state board_init()
{
    hall_gpio_init();
    config_hall_sensor();

    // Turn OFF MODEM
    nrf_gpio_cfg_output(CELL_ENABLE_PIN_O);
    nrf_gpio_pin_clear(CELL_ENABLE_PIN_O);
    nrf_delay_ms(1000);

    nrf_gpio_cfg_output(SENSOR_EN);
    nrf_delay_ms(500);
    nrf_gpio_pin_clear(SENSOR_EN);

    nrf_gpio_cfg_output(GPS_BK_EN);
    nrf_delay_ms(500);
    nrf_gpio_pin_clear(GPS_BK_EN);

    return STATE_GATT_SERVER;
    //return STATE_DEBUG;
    //return STATE_SLEEP;
}

void ble_radio_setup()
{   
    // Disable SD
    nrf_sdh_disable_request();

    // Configure HFCLK
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;
    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.

    // Disable Radio
    NRF_RADIO->SHORTS = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_TXEN = 0;
    NRF_RADIO->TASKS_STOP = 1;
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->EVENTS_END = 1U;

    while (NRF_RADIO->EVENTS_DISABLED == 0){  }    // Do nothing.

    NRF_RADIO->EVENTS_DISABLED = 0;
}

sm_state start_gatt_server()
{
    setConfig(120000);

    if(celltxrx != 0){
    nrf_gpio_pin_set(CELL_ENABLE_PIN_O);
    nrf_delay_ms(2000);
    init_Modem();
    }
    
    //STATE_BLE_CONT_CW_TX
    if(MODE == 2 && celltxrx == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_BLE_CONT_CW_TX;
    }

    else if(MODE == 0 && celltxrx == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_SLEEP;
    }
    
    //STATE_BLE_CONT_MCW_TX
    else if(MODE == 3 && celltxrx == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_BLE_CONT_MCW_TX;
    }

    //STATE_BLE_CONT_RX
    else if(MODE == 2 && celltxrx == 0 && advTime == 0 && scanDuration > 0 && sleepTime == 0){
    return STATE_BLE_CONT_RX;
    }

    //STATE_BLE_INT_CW_TX
    else if(MODE == 2 && celltxrx == 0 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_BLE_INT_CW_TX;
    }
    
