ananawaretrk/Opal_Fcc_nrf52810/fcc_onyx_2/main.cpp
    //STATE_BLE_INT_MCW_TX
    else if(MODE == 3 && celltxrx == 0 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_BLE_INT_MCW_TX;
    }

    //STATE_BLE_INT_RX
    else if(MODE == 2 && celltxrx == 0 && advTime == 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_RX;
    }

    //--STATE_BLE_INT_CW_TX_RX
    else if(MODE == 2 && celltxrx == 0 && advTime > 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_CW_TX_RX;
    }

    //STATE_BLE_INT_MCW_TX_RX
    else if(MODE == 3 && celltxrx == 0 && advTime > 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_MCW_TX_RX;
    }

    //STATE_LTE_CONT_CW_TX
    else if(MODE == 2 && celltxrx == 1 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LTE_CONT_CW_TX;
    }

    //STATE_LTE_CONT_MCW_TX
    else if(MODE == 3 && celltxrx == 1 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LTE_CONT_MCW_TX;
    }

    //STATE_LTE_CONT_RX
    else if(MODE == 2 && celltxrx == 2 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LTE_CONT_RX;
    }

    //STATE_LTE_INT_CW_TX
    else if(MODE == 2 && celltxrx == 1 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_LTE_INT_CW_TX;
    }

    //STATE_LTE_INT_MCW_TX
    else if(MODE == 3 && celltxrx == 1 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_LTE_INT_MCW_TX;
    }

    //STATE_LTE_INT_RX
    else if(MODE == 2 && celltxrx == 2 && advTime == 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_LTE_INT_RX;
    }
    
    //Default
    return STATE_SLEEP;
}
sm_state ble_cont_cw_tx()
{
  // Configure BLE Radio
  ble_radio_setup();

  // Run CW 
  radio_config();

  return STATE_SLEEP;
}
sm_state ble_cont_mcw_tx()
{
  // Configure BLE Radio
  ble_radio_setup();
  
  //Run Modulated CW
  modulation();

  return STATE_SLEEP;
}
sm_state ble_cont_rx()
{
  bleScan(scanDuration);

  return STATE_BLE_CONT_RX;
}

sm_state ble_int_cw_tx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        radio_config();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state ble_int_mcw_tx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run MCW
        modulation();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop MCW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state ble_int_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run scan for x seconds
        bleScan(scanDuration);

        // Do not scan and sleep for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state ble_int_cw_tx_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        radio_config();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Run scan for x seconds
        bleScan(scanDuration);
    }

    return STATE_SLEEP;
}
sm_state ble_int_mcw_tx_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        modulation();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Run scan for x seconds
        bleScan(scanDuration);
    }

    return STATE_SLEEP;
}
sm_state lte_cont_cw_tx()
{
    nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, false);

    while (1)
    {
        nrf_pwr_mgmt_run();
    }
    
    return STATE_SLEEP;
}
sm_state lte_cont_mcw_tx()
{
    nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, true);

    while (1)
    {
        nrf_pwr_mgmt_run();
    }

    return STATE_SLEEP;
}
sm_state lte_cont_rx()
{
    nbiot_instance.CwFunction(0, 1, channel, cellrxpowerlevel, false);
    while (1)
    {
        nrf_pwr_mgmt_run();
    }
    
    return STATE_SLEEP;
}
sm_state lte_int_cw_tx()
{
    while (1)
    {
        nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, false);

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        nbiot_instance.CwFunction(1, 0, channel, cellpowerlevel, false);

        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}

sm_state lte_int_mcw_tx()
{
    while (1)
    {
        nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, true);

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

